Step_3/small_jet_base/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

kInlet          0.0024;

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0000365;

boundaryField
{
	#includeEtc "caseDicts/setConstraintTypes"

    jet_inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform $kInlet;
    }

    "(left_side|right_side|outlet)"
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    "(inlet|wall_inlet)"
    {
        type            fixedValue;
        value           uniform 0;
    }

    "(top|bottom)"
    {
	type            fixedValue;
    value           uniform 0;
    }

}

// ************************************************************************* //
