Step_3/small_jet_base/0/nut
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
#includeEtc "caseDicts/setConstraintTypes"

    "(jet_inlet|inlet|outlet|top|bottom|wall_inlet|left_side|right_side)"
    {
        type            calculated;
        value           $internalField;
    }
}


// ************************************************************************* //
