Step_3/small_jet_base/0/ph_rgh.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ph_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
	#includeEtc "caseDicts/setConstraintTypes"

    top
    {
        type            fixedValue;
        value           $internalField;
    }

    "(left_side|right_side)"
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    bottom
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    outlet
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    inlet
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    jet_inlet
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    wall_inlet
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

}


// ************************************************************************* //
