Step_3/small_jet_base/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward; //provare a crank o backward
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default             none;

    div(phi,U)        Gauss limitedLinearV 1;
    div(phi,k)        Gauss limitedLinear 1;  // Gauss limitedLinear 1;
    div(phi,e)        Gauss limitedLinear 1;  // Gauss limitedLinear 1;
    div(phi,K)        Gauss linear;  //Gauss linear;
    div(phi,sca)        Gauss vanLeer; //Switched due to instability at start, probably able to switch back on finer mesh
    div(phi,(p|rho)) Gauss linear;//Gauss linear; //bounded Gauss limitedLinear 1;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

// ************************************************************************* //
